# EDA for ML ( Cleaning data, taking insights out of data )

In [44]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.ticker as mtick
%matplotlib inline

In [45]:
df = pd.read_csv(r"C:\Users\Shravan\OneDrive\Documents\I L - Imarticus Learning Material\ML\EDA\Churn_Modelling.csv")
df.head(3)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1

In [46]:
df.describe()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.00000,1.000000e+04,10000.000000,9994.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,5000.50000,1.569094e+07,650.528800,38.923354,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,2886.89568,7.193619e+04,96.653299,10.488658,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,1.00000,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,2500.75000,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,5000.50000,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,7500.25000,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,10000.00000,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

# Read null or missing values

In [47]:
df.info()
# Total 14 columns including those columns which contains null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           9996 non-null   object
 6   Age              9994 non-null   float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

In [48]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             4
Age                6
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [49]:
# isnull shows count of null values present in a specific column

# Below operation gives us those records that contains null values

In [50]:
filtered_df = df[df[["Gender", "Age"]].isnull().any(axis = 1)][["Gender", "Age"]]
filtered_df

    Gender   Age
9     Male   NaN
10     NaN  31.0
17     NaN   NaN
23    Male   NaN
24     NaN  38.0
28     NaN   NaN
50    Male   NaN
66  Female   NaN

# Handling missing values

***deleting the columns with missing data***

In [51]:
updated_df = df.dropna(axis = 1)
updated_df.info()
# So it gives 12 columns. here 2 columns has dropped which contains null values. gender and age
# Although inplace = True is necessary to delete it permanently

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Tenure           10000 non-null  int64
 6   Balance          10000 non-null  float64
 7   NumOfProducts    10000 non-null  int64
 8   HasCrCard        10000 non-null  int64
 9   IsActiveMember   10000 non-null  int64
 10  EstimatedSalary  10000 non-null  float64
 11  Exited           10000 non-null  int64
dtypes: float64(2), int64(8), object(2)
memory usage: 937.6+ KB

In [52]:
# Deleting the columns directly which has null values is not a good approach to remove null values.
# We may lose some imp info in in other records in the same column. This kind of approach only when there are many null values in the specific column
# The columns which has min 40% of null values, can be deleted only.

***Deleting the rows where missing values or null values are present***

In [53]:
updated_df = df.dropna(axis = 0)
updated_df.info()
# Here axis = 0 means we are deleting rows where there is null values.
# So here total 8 records have null values in gender and age columns. so total 8 records have deleted. (10000 - 8 = 9992)
# Although inplace = True is necessary to delete it permanently

<class 'pandas.core.frame.DataFrame'>
Index: 9992 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        9992 non-null   int64
 1   CustomerId       9992 non-null   int64
 2   Surname          9992 non-null   object
 3   CreditScore      9992 non-null   int64
 4   Geography        9992 non-null   object
 5   Gender           9992 non-null   object
 6   Age              9992 non-null   float64
 7   Tenure           9992 non-null   int64
 8   Balance          9992 non-null   float64
 9   NumOfProducts    9992 non-null   int64
 10  HasCrCard        9992 non-null   int64
 11  IsActiveMember   9992 non-null   int64
 12  EstimatedSalary  9992 non-null   float64
 13  Exited           9992 non-null   int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

# Filling missing values

***If column is numerical and it contains missing values, we can fill those records with avg or median of that column***

In [54]:
df.describe()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.00000,1.000000e+04,10000.000000,9994.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,5000.50000,1.569094e+07,650.528800,38.923354,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,2886.89568,7.193619e+04,96.653299,10.488658,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,1.00000,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,2500.75000,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,5000.50000,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,7500.25000,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,10000.00000,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

In [55]:
df["Age"].mean()

38.923354012407444

In [56]:
df["Age"].median()

37.0

### fillna = fills the null records
### dropna = drops the null records

In [57]:
updated_df = df
updated_df["Age"] = updated_df["Age"].fillna(df["Age"].mean())
updated_df.info()
# We filled na values with mean (avg) of Age column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           9996 non-null   object
 6   Age              10000 non-null  float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

In [58]:
# We cannot fill na values in gender column with any other values as it is categorical. Although we can if either male or female count is high.
# But it may directly impact on other records. So we refused that

# Imputation = Backward filling & Forward filling

In [59]:
df1 = df
df1["Age"] = df1["Age"].bfill()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           9996 non-null   object
 6   Age              10000 non-null  float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

### bfill will fill the value of previous record to na value
### ffill will fill the value of next record to na value

In [60]:
df["Gender"].value_counts()
# count of male is max. so we can fill na with male value using mode

Gender
Male      5456
Female    4540
Name: count, dtype: int64

mode_gender = df["Gender"].mode()
mode_gender

df["Gender"] = df["Gender"].fillna(mode_gender)
df["Gender"].info()
# So we can fill string data using mode (category type of data)

In [61]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Length: 10000, dtype: bool

In [62]:
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler

# What is Normalization
### Normalization is a scaling technique in which values are shifted and rescaled. So that they end up ranging between 0 and 1.

# What is Standardization

### Standardization is another one scaling technique where the values are centered around the mean with a unit standard deviation.

### This means that the mean of the attribute becomes zero and the resultant distribution has a unit standard deviation

In [63]:
df.describe().round(2)
# rounding up all values with 2 decimal places

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.0
mean,5000.50,15690940.57,650.53,38.92,5.01,76485.89,1.53,0.71,0.52,100090.24,0.2
std,2886.90,71936.19,96.65,10.49,2.89,62397.41,0.58,0.46,0.50,57510.49,0.4
min,1.00,15565701.00,350.00,18.00,0.00,0.00,1.00,0.00,0.00,11.58,0.0
25%,2500.75,15628528.25,584.00,32.00,3.00,0.00,1.00,0.00,0.00,51002.11,0.0
50%,5000.50,15690738.00,652.00,37.00,5.00,97198.54,1.00,1.00,1.00,100193.92,0.0
75%,7500.25,15753233.75,718.00,44.00,7.00,127644.24,2.00,1.00,1.00,149388.25,0.0
max,10000.00,15815690.00,850.00,92.00,10.00,250898.09,4.00,1.00,1.00,199992.48,1.0

In [64]:
df.head(5)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

In [65]:
df.shape

(10000, 14)

In [66]:
new_df = pd.DataFrame(df, columns = ["Age", "Tenure"])
new_df.head(5)

    Age  Tenure
0  42.0       2
1  41.0       1
2  42.0       8
3  39.0       1
4  43.0       2

In [67]:
# scaler = MinMaxScaler()
# mean1 = np.mean(normalized_arr_ss)
# std.dev1 = np.std(normalized_arr_ss)

In [73]:
df.Gender.mode()

0    Male
Name: Gender, dtype: object

In [76]:
df["Gender"].value_counts()
# count of male is max. so we can fill na with male value using mode

Gender
Male      5456
Female    4540
male         4
Name: count, dtype: int64

In [89]:
df["Gender"] = df["Gender"].fillna("Male")
df["Gender"]

0       Female
1       Female
2       Female
3       Female
4       Female
         ...
9995      Male
9996      Male
9997    Female
9998      Male
9999    Female
Name: Gender, Length: 10000, dtype: object

In [90]:
df.Gender.value_counts()

Gender
Male      5460
Female    4540
Name: count, dtype: int64

df["Gender"] = df["Gender"].str.capitalize()
df["Gender"]
# In case if I entered male instead of Male, I can use this code to make it capitalize the initial of male into Male

In [91]:
df.Gender.value_counts()

Gender
Male      5460
Female    4540
Name: count, dtype: int64

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

# Label Encoding

### Label encoding is used when there are only 2 categories in one column, and I want to make it in numerical form (like 0 and 1)
### So I use label encoding to make it 0 and 1. But this is possible only in case of 2 categories

In [95]:
from sklearn import preprocessing

In [97]:
le = preprocessing.LabelEncoder()
df["Gender_label"] = le.fit_transform(df.Gender.values)
# Here we are making values in gender column like male and female as 0 and 1 using label encoder function. (String into number)

In [99]:
df.sample(5)
# Male = 1, Female = 0 ----> using lable encoding

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_label
6619,6620,15586517,Toscano,647,France,Male,32.0,5,97041.16,1,1,1,23132.73,0,1
6,7,15592531,Bartlett,822,France,Male,50.0,7,0.00,2,1,1,10062.80,0,1
2466,2467,15719809,Endrizzi,516,Germany,Male,32.0,3,145166.09,2,0,0,111421.45,0,1
2214,2215,15684999,Ch'eng,850,France,Female,26.0,4,62610.96,2,0,1,179365.10,0,0
8428,8429,15566735,Obialo,548,Germany,Female,36.0,2,108913.84,2,1,1,140460.01,0,0

In [101]:
df.Gender_label.value_counts()
# previously it was male female and now it is 1 and 0

Gender_label
1    5460
0    4540
Name: count, dtype: int64

# One Hot Encoding

### One hot encoding is used when there are more than 2 categories in one column and we want to encode them like 0, 1, 2, 3 but as ML prioritize the highest number, we have to encode in such a way that it will represent the categories in 0 and 1 only. So we use one hot encoding in this case.
### So, here True means 1 and False means 0.

In [105]:
one_hot = pd.get_dummies(df["Geography"])
one_hot.sample(5)

      France  Germany  Spain
543    False    False   True
7398   False     True  False
1899   False    False   True
3988   False     True  False
3748    True    False  False